Чаты_единое_окно/src/Catalogs/Криптовалюты/Криптовалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Криптовалюты</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логотип</name>
    <type>
      <types>CatalogRef.КриптовалютыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Чаты_единое_окно/src/Catalogs/Криптовалюты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Создать криптовалютный актив.
// 
// Параметры:
//  ПараметрыСозданияАктива - см. НовыйПараметрыКриптовалютногоАктива.
//
Процедура СоздатьКриптовалютныйАктив(ПараметрыСозданияАктива) Экспорт
	
	КриптовалютныйАктив = СоздатьЭлемент();
	КриптовалютныйАктив.Заполнить(ПараметрыСозданияАктива);		
	ЗаписатьКриптовалютныйАктив(КриптовалютныйАктив); 
	
	//Загрузка файла
	ИмяФайла = КриптовалютныйАктив.Наименование;
	ЗаполнитьДанныеФайлаАктива(КриптовалютныйАктив.Ссылка, ИмяФайла, ПараметрыСозданияАктива);
	
КонецПроцедуры

// Криптовалютные активы к загрузке.
// 
// Параметры:
//  СписокКриптовалютныхАктивов - см. НовыйДанныеКриптовалютныхАктивовКЗагрузке
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Криптовалютные активы к загрузке
//
Функция КриптовалютныеАктивыКЗагрузке(СписокКриптовалютныхАктивов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокКриптовалютныхАктивов.Идентификатор КАК Идентификатор,
	|	СписокКриптовалютныхАктивов.Наименование КАК Наименование,
	|	СписокКриптовалютныхАктивов.Логотип КАК Логотип,
	|	СписокКриптовалютныхАктивов.Описание КАК Описание,
	|	СписокКриптовалютныхАктивов.КраткоеОбозначение КАК КраткоеОбозначение
	|
	|ПОМЕСТИТЬ ВТ_СписокКриптовалютныхАктивов
	|ИЗ
	|	&СписокКриптовалютныхАктивов КАК СписокКриптовалютныхАктивов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокКриптовалютныхАктивов.Идентификатор КАК Идентификатор,
	|	ВТ_СписокКриптовалютныхАктивов.Наименование КАК Наименование,
	|	ВТ_СписокКриптовалютныхАктивов.Логотип КАК Логотип,
	|	ВТ_СписокКриптовалютныхАктивов.Описание КАК Описание,
	|	ВТ_СписокКриптовалютныхАктивов.КраткоеОбозначение КАК КраткоеОбозначение
	|ИЗ
	|	ВТ_СписокКриптовалютныхАктивов КАК ВТ_СписокКриптовалютныхАктивов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Криптовалюты КАК Криптовалюты
	|		ПО ВТ_СписокКриптовалютныхАктивов.Идентификатор = Криптовалюты.Идентификатор
	|ГДЕ
	|	Криптовалюты.Ссылка ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("СписокКриптовалютныхАктивов", СписокКриптовалютныхАктивов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Обновить логотип криптовалютного актива.
// 
// Параметры:
//  КриптовалютныйАктив - СправочникСсылка.Криптовалюты
//  ПрисоединенныйФайл - СправочникСсылка.КриптовалютыПрисоединенныеФайлы
//
Процедура ОбновитьЛоготипКриптовалютногоАктива(КриптовалютныйАктив, ПрисоединенныйФайл) Экспорт
	
	КриптовалютныйАктивОбъект = КриптовалютныйАктив.ПолучитьОбъект();
	КриптовалютныйАктивОбъект.Логотип = ПрисоединенныйФайл;
	ЗаписатьКриптовалютныйАктив(КриптовалютныйАктивОбъект);
	
КонецПроцедуры

// Криптовалютные активы к обработке.
// 
// Параметры:
//  СписокКриптовалютныхАктивов - см. НовыйДанныеКриптовалютныхАктивовКЗагрузке
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Криптовалютные активы к обработке
//
Функция КриптовалютныеАктивыКОбработке(СписокКриптовалютныхАктивов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокКриптовалютныхАктивов.Идентификатор КАК Идентификатор,
	|	СписокКриптовалютныхАктивов.Цена КАК Цена,
	|	СписокКриптовалютныхАктивов.Капитализация КАК Капитализация,
	|	СписокКриптовалютныхАктивов.ОбщийОбъем КАК ОбщийОбъем,
	|	СписокКриптовалютныхАктивов.МаксимальныйОбъем КАК МаксимальныйОбъем
	|
	|ПОМЕСТИТЬ ВТ_СписокКриптовалютныхАктивовСЦеновымиПоказателями
	|ИЗ
	|	&СписокКриптовалютныхАктивов КАК СписокКриптовалютныхАктивов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Криптовалюты.Ссылка КАК Криптовалюта,
	|	ВТ_СписокКриптовалютныхАктивовСЦеновымиПоказателями.Идентификатор КАК Идентификатор,
	|	ВТ_СписокКриптовалютныхАктивовСЦеновымиПоказателями.Цена КАК Цена,
	|	ВТ_СписокКриптовалютныхАктивовСЦеновымиПоказателями.Капитализация КАК Капитализация,
	|	ВТ_СписокКриптовалютныхАктивовСЦеновымиПоказателями.ОбщийОбъем КАК ОбщийОбъем,
	|	ВТ_СписокКриптовалютныхАктивовСЦеновымиПоказателями.МаксимальныйОбъем КАК МаксимальныйОбъем
	|ИЗ
	|	ВТ_СписокКриптовалютныхАктивовСЦеновымиПоказателями КАК ВТ_СписокКриптовалютныхАктивовСЦеновымиПоказателями
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Криптовалюты КАК Криптовалюты
	|		ПО ВТ_СписокКриптовалютныхАктивовСЦеновымиПоказателями.Идентификатор = Криптовалюты.Идентификатор
	|";
	
	Запрос.УстановитьПараметр("СписокКриптовалютныхАктивов", СписокКриптовалютныхАктивов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйПараметрыКриптовалютногоАктива() Экспорт
	
	ПараметрыАктива = Новый Структура;
	ПараметрыАктива.Вставить("Наименование", "");
	ПараметрыАктива.Вставить("Идентификатор", 0);
	ПараметрыАктива.Вставить("КраткоеОбозначение", "");
	ПараметрыАктива.Вставить("Логотип", "");
	ПараметрыАктива.Вставить("Описание", "");
	
	Возврат ПараметрыАктива;
	
КонецФункции

Функция НовыйДанныеКриптовалютныхАктивовКЗагрузке() Экспорт
	
	ДанныеКриптовалютыКЗагрузке = Новый ТаблицаЗначений();
	ДанныеКриптовалютыКЗагрузке.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ДанныеКриптовалютыКЗагрузке.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ДанныеКриптовалютыКЗагрузке.Колонки.Добавить("Логотип", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ДанныеКриптовалютыКЗагрузке.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ДанныеКриптовалютыКЗагрузке.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ДанныеКриптовалютыКЗагрузке.Колонки.Добавить("Капитализация", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ДанныеКриптовалютыКЗагрузке.Колонки.Добавить("ОбщийОбъем", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ДанныеКриптовалютыКЗагрузке.Колонки.Добавить("МаксимальныйОбъем", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ДанныеКриптовалютыКЗагрузке.Колонки.Добавить("КраткоеОбозначение", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Возврат ДанныеКриптовалютыКЗагрузке;
	
КонецФункции

Процедура ЗаполнитьДанныеФайлаАктива(КриптовалютныйАктив, ИмяФайла, ПараметрыСозданияАктива) 
	
	Если ЗначениеЗаполнено(ПараметрыСозданияАктива.Логотип) Тогда   
		
		ДанныеФайла = ПолучениеФайловИзИнтернета.СкачатьФайлВоВременноеХранилище(ПараметрыСозданияАктива.Логотип);
		
		Если ДанныеФайла.Статус Тогда	
			ПараметрыФайла = НовыйПараметрыФайла(КриптовалютныйАктив, ИмяФайла);
			ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ДанныеФайла.Путь);
			ОбновитьЛоготипКриптовалютногоАктива(КриптовалютныйАктив, ПрисоединенныйФайл);	
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция НовыйПараметрыФайла(КриптовалютныйАктив, ИмяФайла)
		
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.Автор = ПараметрыСеанса.ТекущийПользователь;
	ПараметрыФайла.ВладелецФайлов = КриптовалютныйАктив;  
	ПараметрыФайла.ИмяБезРасширения = ИмяФайла;
	ПараметрыФайла.РасширениеБезТочки = "png";
		
	Возврат ПараметрыФайла;
	
КонецФункции

Процедура ЗаписатьКриптовалютныйАктив(АктивОбъект)
	
	Если АктивОбъект.ПроверитьЗаполнение() Тогда
		АктивОбъект.Записать();
	Иначе
		ВызватьИсключение НСтр("ru='Не удалось записать новый криптовалютный актив, проверка заполнения не пройдена.'");
	КонецЕсли;    
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
